docs/architecture/dsl/local/structurizr-1-SystemLandscape.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram [System Landscape]
    style diagram fill:#ffffff,stroke:#ffffff

    1["<div style='font-weight: bold'>Case Worker (Frontend)</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Case worker creating new<br />cases for the Paper journey.</div>"]
    style 1 fill:#08427b,stroke:#052e56,color:#ffffff
    2["<div style='font-weight: bold'>Donor</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Donors creating a new LPA on<br />the MRLPA service.</div>"]
    style 2 fill:#08427b,stroke:#052e56,color:#ffffff
    3["<div style='font-weight: bold'>Public Actors (API)</div><div style='font-size: 70%; margin-top: 0px'>[Person]</div><div style='font-size: 80%; margin-top:10px'>Users integrating with LPAs<br />such as Solicitors and<br />Charities via an API.</div>"]
    style 3 fill:#08427b,stroke:#052e56,color:#ffffff
    4("<div style='font-weight: bold'>LPA Case Management</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>PKA Sirius.</div>")
    style 4 fill:#999999,stroke:#6b6b6b,color:#ffffff
    5("<div style='font-weight: bold'>Make and Register an LPA</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Manages Online submissions of<br />LPAs.</div>")
    style 5 fill:#999999,stroke:#6b6b6b,color:#ffffff
    6("<div style='font-weight: bold'>LPA Public API</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>API Integration for external<br />integration.</div>")
    style 6 fill:#999999,stroke:#6b6b6b,color:#ffffff
    7("<div style='font-weight: bold'>LPA ID Service</div><div style='font-size: 70%; margin-top: 0px'>[Software System]</div><div style='font-size: 80%; margin-top:10px'>Generates IDs and stores<br />donor details.</div>")
    style 7 fill:#1168bd,stroke:#0b4884,color:#ffffff

    1-. "<div>Uses</div><div style='font-size: 70%'></div>" .->4
    2-. "<div>Uses</div><div style='font-size: 70%'></div>" .->5
    3-. "<div>Uses</div><div style='font-size: 70%'></div>" .->6
    4-. "<div>Makes requests to</div><div style='font-size: 70%'></div>" .->7
    5-. "<div>Makes requests to</div><div style='font-size: 70%'></div>" .->7
    6-. "<div>Makes requests to</div><div style='font-size: 70%'></div>" .->7
  end
